Tekla Open API Reference for Tekla Structures 2025
EmbeddedObjectAttributes.Scaling Property
 Gets or sets the scaling type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public EmbeddedObjectScalingOptions Scaling { get; set; }
Public Property Scaling As EmbeddedObjectScalingOptions
	Get
	Set
Property Value
Type: EmbeddedObjectScalingOptions
See Also
Reference
EmbeddedObjectAttributes Class
Tekla.Structures.Drawing Namespace